01_Overview.org
#+Title: An Introduction to Lean
#+Author: [[http://www.andrew.cmu.edu/user/avigad][Jeremy Avigad]], [[http://leodemoura.github.io][Leonardo de Moura]], [[https://gebner.org/][Gabriel Ebner]], and Sebastian Ullrich

* Overview
:PROPERTIES:
  :CUSTOM_ID: Overview
:END:

This introduction offers a tour of Lean and its features,
with a number of examples for you to play around with and explore. If
you are reading this in our online tutorial system, you can run
examples like the one below by clicking the button that says "try it
yourself."
#+BEGIN_SRC lean
check "hello world!"
#+END_SRC
The response from Lean appears in the small window underneath the
editor text, and also in popup windows that you can read when you
hover over the indicators in the left margin. Alternatively, if you
have installed Lean and have it running in a stand-alone editor, you
can copy and paste examples and try them there.

