01_Overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-10 Sun 21:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>An Introduction to Lean</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="[[http://www.andrew.cmu.edu/user/avigad][Jeremy Avigad]]Jeremy Avigad, [[http://leodemoura.github.io][Leonardo de Moura]]Leonardo de Moura, [[https://gebner.org/][Gabriel Ebner]]Gabriel Ebner, and Sebastian Ullrich" />
<link rel="stylesheet" href="css/tutorial.css"/>
<link rel="stylesheet" href="css/code.css"/>
<link rel='import' href='juicy-ace-editor.html'/>
</head>
<body>
<div id="content">
<h1 class="title">An Introduction to Lean</h1>

<div id="outline-container-org3e20c4d" class="outline-2">
<h2 id="Overview"><a id="org3e20c4d"></a><span class="section-number-2"> 1</span> Overview</h2>
<div class="outline-text-2" id="text-Overview">
<p>
This introduction offers a tour of Lean and its features,
with a number of examples for you to play around with and explore. If
you are reading this in our online tutorial system, you can run
examples like the one below by clicking the button that says "try it
yourself."
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-1' mode="ace/mode/lean" readonly="true">#check "hello world!"
</juicy-ace-editor><div id='lean-full-code-1' style='display:none'>#check "hello world!"
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-1').text());">Try it yourself &raquo;</button></div>
</div>
<p>
The response from Lean appears in the small window underneath the
editor text, and also in popup windows that you can read when you
hover over the indicators in the left margin. Alternatively, if you
have installed Lean and have it running in a stand-alone editor, you
can copy and paste examples and try them there.
</p>
</div>
