01_Overview.org
** Where To Go From Here

We have surveyed a number of ways that Lean can be used, namely, as
- a specification language
- a programming language
- an assertion language
- a proof language
- a gateway to using automation with fully verified results, and
- a metaprogramming language.
Subsequent chapters provide a compendium of examples for you to play
with and enjoy. These chapters are fairly short on explanation,
however, and are not meant to serve as definitive references. If you
are motivated to continue using Lean in earnest, we recommend
continuing, from here, to either of the following more expansive
introductions:

- [[https://leanprover.github.io/theorem_proving_in_lean][Theorem Proving in Lean]]
- [[https://leanprover.github.io/programming_in_lean/][Programming in Lean]]

The first focuses on the use of Lean as a theorem prover, whereas
the second focuses on aspects of Lean related to programming and
metaprogramming.
