01_Overview.html

<div id="outline-container-orgdf9182c" class="outline-3">
<h3 id="orgdf9182c"><span class="section-number-3"> 1.2</span> Where To Go From Here</h3>
<div class="outline-text-3" id="text-1-2">
<p>
We have surveyed a number of ways that Lean can be used, namely, as
</p>
<ul class="org-ul">
<li>a specification language</li>
<li>a programming language</li>
<li>an assertion language</li>
<li>a proof language</li>
<li>a gateway to using automation with fully verified results, and</li>
<li>a metaprogramming language.</li>
</ul>
<p>
Subsequent chapters provide a compendium of examples for you to play
with and enjoy. These chapters are fairly short on explanation,
however, and are not meant to serve as definitive references. If you
are motivated to continue using Lean in earnest, we recommend
continuing, from here, to either of the following more expansive
introductions:
</p>

<ul class="org-ul">
<li><a target='_blank' href="https://leanprover.github.io/theorem_proving_in_lean">Theorem Proving in Lean</a></li>
<li><a target='_blank' href="https://leanprover.github.io/programming_in_lean/">Programming in Lean</a></li>
</ul>

<p>
The first focuses on the use of Lean as a theorem prover, whereas
the second focuses on aspects of Lean related to programming and
metaprogramming.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
